# Pandas
- ### Pandas serves as the standard Python library for handling structured data and performing data analysis.
- ### By structured data, we mean tabular data (with rows and columns), such as data stored in spreadsheets or databases.
- ### In pandas, a data table is called a DataFrame.
- ### The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis".
- ### Originally developed by Wes McKinney in 2008. The source code for Pandas is located at this github repository https://github.com/pandas-dev/pandas
- ### Important learning resources: 
    - #### Pandas documentation: https://pandas.pydata.org/docs/
    - #### Getting statrted: https://pandas.pydata.org/docs/getting_started/index.html#getting-started
    - #### Short Pandas introduction to new users: https://pandas.pydata.org/docs/user_guide/10min.html#min
    - #### Pandas Community tutorials: https://pandas.pydata.org/docs/getting_started/tutorials.html
- ### Main advantages: efficient data structures and user-friendly functionalities for analyzing, cleaning, exploring, and manipulating data.
- ### We import the Pandas library and typically use 'pd' as a shorthand.

In [236]:
import numpy as np
import pandas as pd

## Basic data structures in pandas
- ### Pandas provides two types of classes for handling data:
  - #### 1. Series: a one-dimensional labeled array holding data of any type such as integers, strings, Python objects etc.
  - #### 2. DataFrame: a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

In [237]:
# Series: A Pandas Series is like a column in a table.
# Create a simple Pandas Series from a list:
a = [1,2,3,4,5]

series_data = pd.Series(a) 

print(series_data)
print(type(series_data))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [238]:
# As we can notice in the above output of the pandas series, the values are labeled with their index number starting from 0.
# This label can be used to access a specified value.
print(series_data.index)
print(series_data.values)
print(series_data[0], series_data[4])
print(series_data[1:4]) #Select multiple data based on index

RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]
1 5
1    2
2    3
3    4
dtype: int64

In [239]:
#Note: negative indexing is not available in pandas series.
#print(series_data[-1])

In [240]:
# We can define our own labels in pandas series using the index argument.
a = [1,2,3,4,5]
series_data = pd.Series(a, index=['A','B','C',"D",'E']) 

print(series_data)
print(type(series_data))
print(series_data['D'])

A    1
B    2
C    3
D    4
E    5
dtype: int64
<class 'pandas.core.series.Series'>
4

In [241]:
#defining a pandas series using dictionary (key/value objects as series)
data = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
series_data = pd.Series(data)
print(series_data) #The keys of the dictionary become the labels.
print(series_data['c']) #using label to print the value

a    1
b    2
c    3
d    4
dtype: int64
3

In [242]:
sales_data = {'Product A': 1500, 'Product B': 2200, 'Product C': 1800, 'Product D': 2500}
product_sales = pd.Series(sales_data, name='Sales') #When you create a Pandas Series, you can assign a name to it, and this can be useful, especially when working with DataFrames as this name becomes the column name.
print(product_sales)
# Here, the Pandas Series product_sales is created with the product names as the index and the corresponding sales figures as the data.

Product A    1500
Product B    2200
Product C    1800
Product D    2500
Name: Sales, dtype: int64

In [243]:
#Labels are useful if we want to select only some of the items in the dictionary by specifying the desired items in the index argument.
product_sales_short = pd.Series(sales_data, index=['Product A', 'Product D'])
print(product_sales_short)

Product A    1500
Product D    2500
dtype: int64

In [244]:
# We can use a NumPy array to define a Pandas Series. 
# When we pass a NumPy array to the pd.Series() constructor, the array will be used as the data for the Series.
numpy_array = np.array([10, 20, 30, 40, 50])
series_data = pd.Series(numpy_array)
print(series_data)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [245]:
# We can also create pandas series with missing values using np.NaN
# np.NaN stands for "Not a Number," and it is a special floating-point representation used in computing to represent undefined or unrepresentable values in calculations.
# Simply put, np.NaN is used to represent missing or undefined data in arrays.
arr = np.array([1.0, 2.0, np.NaN, 4.0, 5.0])
series_data = pd.Series(arr)
print(series_data)

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

- ### A DataFrame constitutes a tabular data structure with two dimensions, incorporating rows and columns. 
- ### Each entry in the table possesses an index that uniquely identifies the corresponding observation.

In [246]:
#creating a simple dataframe
data = {"Price": [100, 50, 25],"Quantity": [10,20, 30]}

sales_data_table = pd.DataFrame(data)
print(sales_data_table)
print(type(sales_data_table))

   Price  Quantity
0    100        10
1     50        20
2     25        30
<class 'pandas.core.frame.DataFrame'>

In [247]:
#Example data frame for stock prices of a company.
df = pd.DataFrame(np.random.randint(10,100, size=(30, 2)), columns=["OpeningPrice", 'ClosingPrice'])
print(df)

    OpeningPrice  ClosingPrice
0             17            67
1             18            49
2             90            31
3             34            12
4             47            92
5             58            61
6             34            56
7             44            67
8             95            64
9             49            49
10            55            70
11            96            95
12            52            33
13            97            89
14            66            17
15            11            32
16            25            36
17            84            20
18            37            99
19            10            17
20            31            34
21            51            93
22            60            16
23            35            58
24            23            38
25            72            90
26            55            25
27            90            87
28            74            74
29            29            76

In [248]:
# We can save a dataframe to another file format, e.g., csv, excel, parquet, etc.
filename='stock_price_data.xlsx'
df.to_excel(filename, index=False)
#df.to_csv("filename", index=False)

## Viewing Data in Pandas DataFrame

In [249]:
# Importing data from other sourses:
# If the data is saved in an alternative format, it can be imported using pd.read_filetype("file"), which could include file types like Excel, CSV, and others.
df=pd.read_excel("product_data.xlsx")
#Complete syntax for reading excel file here: https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html

In [250]:
#check the column names
df.columns

Index(['Product', 'SKU', 'Price', 'Quantity_Sold', 'Revenue'], dtype='object')

In [251]:
#check the datatypes of all columns
df.dtypes #In a Pandas DataFrame, the "object" data type typically refers to columns that contain string values or a mix of different data types.

Product           object
SKU               object
Price            float64
Quantity_Sold      int64
Revenue          float64
dtype: object

In [252]:
#Info About the Data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        100 non-null    object
 1   SKU            100 non-null    object
 2   Price          100 non-null    float64
 3   Quantity_Sold  100 non-null    int64
 4   Revenue        100 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 4.0+ KB

In [253]:
#Use DataFrame.head() to view the top rows of the frame
df.head()

     Product    SKU  Price  Quantity_Sold   Revenue
0  Product_1  SKU_1  43.71            112   4895.52
1  Product_2  SKU_2  95.56            401  38319.56
2  Product_3  SKU_3  75.88            280  21246.40
3  Product_4  SKU_4  63.88            290  18525.20
4  Product_5  SKU_5  24.04            101   2428.04

In [254]:
# Use DataFrame.tail() to view the bottom rows of the frame
df.tail()

        Product      SKU  Price  Quantity_Sold   Revenue
95   Product_96   SKU_96  54.44            209  11377.96
96   Product_97   SKU_97  57.05            247  14091.35
97   Product_98   SKU_98  48.48            465  22543.20
98   Product_99   SKU_99  12.29            296   3637.84
99  Product_100  SKU_100  19.71            373   7351.83

In [255]:
# DataFrame.shape returns the total number of rows and columns of the data table
df.shape

(100, 5)

In [256]:
# DataFrame.index displays the index values of the dataframe
df.index

RangeIndex(start=0, stop=100, step=1)

In [257]:
#selecting a column
df['Product']

0       Product_1
1       Product_2
2       Product_3
3       Product_4
4       Product_5
         ...
95     Product_96
96     Product_97
97     Product_98
98     Product_99
99    Product_100
Name: Product, Length: 100, dtype: object

In [258]:
# display values of a particular column
df['Product'].head()

0    Product_1
1    Product_2
2    Product_3
3    Product_4
4    Product_5
Name: Product, dtype: object

In [259]:
# Locate row: Pandas use the loc attribute to return one or more specified row(s)
print(df.loc[0])
print(type(df.loc[0])) #data type is pandas series

Product          Product_1
SKU                  SKU_1
Price                43.71
Quantity_Sold          112
Revenue            4895.52
Name: 0, dtype: object
<class 'pandas.core.series.Series'>

In [260]:
print(df.loc[0: 5]) #also written as df.loc[[0, 1]]

print(type((df.loc[0: 1])))

     Product    SKU  Price  Quantity_Sold   Revenue
0  Product_1  SKU_1  43.71            112   4895.52
1  Product_2  SKU_2  95.56            401  38319.56
2  Product_3  SKU_3  75.88            280  21246.40
3  Product_4  SKU_4  63.88            290  18525.20
4  Product_5  SKU_5  24.04            101   2428.04
5  Product_6  SKU_6  24.04            145   3485.80
<class 'pandas.core.frame.DataFrame'>

In [261]:
df.loc[[0, 1, 7]]

     Product    SKU  Price  Quantity_Sold   Revenue
0  Product_1  SKU_1  43.71            112   4895.52
1  Product_2  SKU_2  95.56            401  38319.56
7  Product_8  SKU_8  87.96            271  23837.16

In [262]:
# loc is used to retrieve values based on labels.
# If labels are named then we use loc: e.g, df.loc["indexname"]
# while iloc is used to retrieve values based on integer positions of columns.
df.iloc[1]  
# df.iloc[1:4]

Product          Product_2
SKU                  SKU_2
Price                95.56
Quantity_Sold          401
Revenue           38319.56
Name: 1, dtype: object

In [263]:
# We can return a NumPy representation of the underlying data with DataFrame.to_numpy() without the index or column labels:
df_array= df.to_numpy()
#print(df_array)

In [264]:
#df=pd.read_excel("..\PGDM Attendance Sheet -  TERM 2 - BATCH 6.xlsx", header=3, skiprows=[4,17,34])

In [265]:
titanic_df = pd.read_csv("titanic.csv")
# The data consists of the following data columns:
# PassengerId: Id of every passenger.
# Survived: Indication whether passenger survived. 0 for yes and 1 for no.
# Pclass: One out of the 3 ticket classes: Class 1, Class 2 and Class 3.
# Name: Name of passenger.
# Sex: Gender of passenger.
# Age: Age of passenger in years.
# SibSp: Number of siblings or spouses aboard.
# Parch: Number of parents or children aboard.
# Ticket: Ticket number of passenger.
# Fare: Indicating the fare.
# Cabin: Cabin number of passenger.
# Embarked: Port of embarkation.

In [266]:
titanic_df.info() #display information about the imported data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [267]:
titanic_df.head() #display first five observations

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [268]:
titanic_df.tail(7) #display last 7 observations

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.125,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.450,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.750,NaN,Q

In [269]:
#selecting a particular column
fares=  titanic_df['Fare']
print(type(fares))
print(fares.shape)

<class 'pandas.core.series.Series'>
(891,)

In [270]:
#creating a new column
# suppose we want to create a new column in the Titanic dataset that represents the total family size of each passenger. 
#The family size can be calculated by adding the 'SibSp' (number of siblings/spouses aboard) and 'Parch' (number of parents/children aboard) columns.
titanic_df['FamilySize'] = titanic_df['SibSp'] + titanic_df['Parch']
print(titanic_df.shape)
titanic_df.head(2)

(891, 13)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

In [271]:
print(fares.max()) #display the maximum, minimum and average values of fares
print(fares.min())
print(fares.mean())
print(fares.median())
print(round(np.std(fares)))
print(f'{np.var(fares, ddof=1):.2f}') #np.var() in NumPy, by default, calculates the population variance (using ddof=0) ddof is delta degree of freedom

512.3292
0.0
32.2042079685746
14.4542
50
2469.44

In [272]:
#We can use the above descriptive stats function directly with dataframe as well (without the need of storing a column in a new variable)
print(titanic_df['Fare'].max()) #display the maximum, minimum and average values of fares
print(titanic_df['Fare'].min())
print(titanic_df['Fare'].mean())
print(titanic_df['Fare'].median())
print(titanic_df['Fare'].std())
print(titanic_df['Fare'].var()) #.var() in pandas, by default, calculates the sample variance (using ddof=1)

512.3292
0.0
32.2042079685746
14.4542
49.693428597180905
2469.436845743117

In [273]:
#describe() returns summary statistics
titanic_df["Age"].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [274]:
titanic_df[["Age", "Fare"]].describe()

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [275]:
# creating a (subset) new dataframe from an exist dataframe
# suppose we just want a dataframe with Name, age and sex of the Titanic passengers.
# We use a list of column names within the selection brackets
name_age_sex_df = titanic_df[['Name', "Age", "Sex"]] #The inner square brackets define a Python list with column names, whereas the outer brackets are used to select the data from a pandas DataFrame
print(type(name_age_sex_df))
print(name_age_sex_df.shape)

<class 'pandas.core.frame.DataFrame'>
(891, 3)

In [276]:
name_age_sex_df.rename(columns= {"Name": "name"},inplace=True)
name_age_sex_df.head()

C:\Users\roygo\AppData\Local\Temp\ipykernel_29312\339001927.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  name_age_sex_df.rename(columns= {"Name": "name"},inplace=True)

                                                name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male

In [277]:
#crete a new filtered dataframe from an existing dataframe. let us filter for people older than 35 years.
above_35_df = name_age_sex_df["Age"] > 35 # Note: if you provide a condition like this, a series is created containing the boolean result from the filter condition
print(above_35_df[0:5])
print (type(above_35_df))
# to create a filtered dataframe pass the condition on the column with the existing dataframe. Only rows for which the condition's value is True will be selected.
above_35_df = name_age_sex_df[name_age_sex_df["Age"] > 35]
above_35_df.head()

0    False
1     True
2    False
3    False
4    False
Name: Age, dtype: bool
<class 'pandas.core.series.Series'>

                                                 name   Age     Sex
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
6                             McCarthy, Mr. Timothy J  54.0    male
11                           Bonnell, Miss. Elizabeth  58.0  female
13                        Andersson, Mr. Anders Johan  39.0    male
15                   Hewlett, Mrs. (Mary D Kingcome)   55.0  female

In [278]:
#filtering based on more than one condition: 
#When combining multiple conditional statements, each condition must be surrounded by parentheses (). 
#Moreover, you can not use or/and but need to use the or operator | and the and operator &
above_35_male_df=name_age_sex_df[(name_age_sex_df["Age"] > 35) & (name_age_sex_df["Sex"]=="male")]
print(above_35_male_df.shape)
above_35_male_df.head()

(144, 3)

                              name   Age   Sex
6          McCarthy, Mr. Timothy J  54.0  male
13     Andersson, Mr. Anders Johan  39.0  male
30        Uruchurtu, Don. Manuel E  40.0  male
33           Wheadon, Mr. Edward H  66.0  male
35  Holverson, Mr. Alexander Oskar  42.0  male

In [279]:
# filter titanic dataframe for above 35 age passengers from cabin class 2 and 3 only.
above_35_cabin_df=titanic_df[(titanic_df["Age"] > 35) & ((titanic_df["Pclass"]==2) |(titanic_df["Pclass"]==3))]
print(above_35_cabin_df.shape)
above_35_cabin_df.head()

(113, 13)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,6
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,6
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S,0
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S,1

In [280]:
# the above task can be performed by using the .isin() function as follows:
above_35_cabin_df=titanic_df[(titanic_df["Age"] > 35) & (titanic_df["Pclass"].isin([2, 3]))] #Similar to the conditional expression, the isin() conditional function returns a True for each row the values are in the provided list. 
print(above_35_cabin_df.shape)
above_35_cabin_df.head()

(113, 13)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S,6
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,0
25,26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",female,38.0,1,5,347077,31.3875,NaN,S,6
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S,0
40,41,0,3,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",female,40.0,1,0,7546,9.4750,NaN,S,1

In [1]:
#selecting specific rows and columns from a dataframe using the loc or iloc 
#syntax: DataFrame.loc[desired_rows, desired_columns]
new_df = titanic_df.iloc[9:25, 2:5] #end values are not included
print(type(new_df))
print(new_df.shape)
new_df

NameError: name 'titanic_df' is not defined

In [282]:
#resetting index to start from zero. In the above output indexing is starting from 9 onwards.
new_df.reset_index(drop=True, inplace=True) #In this example, reset_index(drop=True) is used to reset the index and drop the old index column.inplace=True modify the original DataFrame in-place
new_df.head()

   Pclass                                 Name     Sex
0       2  Nasser, Mrs. Nicholas (Adele Achem)  female
1       3      Sandstrom, Miss. Marguerite Rut  female
2       1             Bonnell, Miss. Elizabeth  female
3       3       Saundercock, Mr. William Henry    male
4       3          Andersson, Mr. Anders Johan    male

In [283]:
#we can assign new values to a selection based on loc/iloc
new_df.iloc[0:3,1:2] = "anonymous"
new_df.head()

   Pclass                            Name     Sex
0       2                       anonymous  female
1       3                       anonymous  female
2       1                       anonymous  female
3       3  Saundercock, Mr. William Henry    male
4       3     Andersson, Mr. Anders Johan    male

In [284]:
"anonymous" in titanic_df['Name'] #original data is also modified.

False

In [285]:
#copying dataframe: 
#If you want to create a completely independent copy of the original DataFrame, you can use the copy() method. 
#This ensures that any changes made to new_df do not affect old_df, and vice versa. 
#This is particularly useful when you want to experiment with modifications without altering the original DataFrame.
titanic_copy_df = titanic_df.copy()

In [286]:
#Changing index and dropping columns
df= pd.DataFrame(titanic_df, index= titanic_df['PassengerId'] ) #Set index = PassengerId
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
PassengerId,,,,,,,,,,,,,
1,2.0,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C,1.0
2,3.0,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S,0.0
3,4.0,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S,1.0
4,5.0,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S,0.0
5,6.0,0.0,3.0,"Moran, Mr. James",male,NaN,0.0,0.0,330877,8.4583,NaN,Q,0.0

In [287]:
df_modified=df.drop(["PassengerId"],axis=1) 
#Because We've set index to PassengerId, so we drop the Date columns in the Data. 
#The axis=1 parameter indicates that the operation should be performed along columns.
df_modified.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
PassengerId,,,,,,,,,,,,
1,1.0,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1.0,0.0,PC 17599,71.2833,C85,C,1.0
2,1.0,3.0,"Heikkinen, Miss. Laina",female,26.0,0.0,0.0,STON/O2. 3101282,7.9250,NaN,S,0.0
3,1.0,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1.0,0.0,113803,53.1000,C123,S,1.0
4,0.0,3.0,"Allen, Mr. William Henry",male,35.0,0.0,0.0,373450,8.0500,NaN,S,0.0
5,0.0,3.0,"Moran, Mr. James",male,NaN,0.0,0.0,330877,8.4583,NaN,Q,0.0

In [288]:
#check data distribution
print(titanic_df['Pclass'].value_counts())

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [289]:
#sorting data
titanic_df.sort_values(by ="Age", ascending=False).head() # of we do not pass the ascending parameter the data will sorted in ascending as by default sort is ascending

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,FamilySize
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S,0
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S,0
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,0
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C,0
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q,0

In [290]:
#Transposing your data: DataFrame.T
transpose_df=titanic_df.T
print(transpose_df.shape)
transpose_df.head()

(13, 891)

,0,1,2,3,4,5,6,7,8,9,...,881,882,883,884,885,886,887,888,889,890
PassengerId,1,2,3,4,5,6,7,8,9,10,...,882,883,884,885,886,887,888,889,890,891
Survived,0,1,1,1,0,0,0,0,1,1,...,0,0,0,0,0,0,1,0,1,0
Pclass,3,1,3,1,3,3,1,3,3,2,...,3,3,2,3,3,2,1,3,1,3
Name,"Braund, Mr. Owen Harris","Cumings, Mrs. John Bradley (Florence Briggs Th...","Heikkinen, Miss. Laina","Futrelle, Mrs. Jacques Heath (Lily May Peel)","Allen, Mr. William Henry","Moran, Mr. James","McCarthy, Mr. Timothy J","Palsson, Master. Gosta Leonard","Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","Nasser, Mrs. Nicholas (Adele Achem)",...,"Markun, Mr. Johann","Dahlberg, Miss. Gerda Ulrika","Banfield, Mr. Frederick James","Sutehall, Mr. Henry Jr","Rice, Mrs. William (Margaret Norton)","Montvila, Rev. Juozas","Graham, Miss. Margaret Edith","Johnston, Miss. Catherine Helen ""Carrie""","Behr, Mr. Karl Howell","Dooley, Mr. Patrick"
Sex,male,female,female,female,male,male,male,male,female,female,...,male,female,male,male,female,male,female,female,male,male

### Handling Missing Data

In [291]:
titanic_df = pd.read_csv("titanic.csv")

In [292]:
titanic_df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [293]:
titanic_df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [294]:
# count the total number of missing data by columns:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [295]:
#dropna() delete rows that contain missing values (entire observation gets deleted even if one of the column's data is missing.

nonmissing_data= titanic_df.dropna()
print(nonmissing_data.shape)
print(titanic_df.shape)
print(type(nonmissing_data))

#If we set the argument how = "all", it will only delete rows where all values are missing.
nonmissing_data= titanic_df.dropna(how="all")
print(nonmissing_data.shape)

(183, 12)
(891, 12)
<class 'pandas.core.frame.DataFrame'>
(891, 12)

In [296]:
#filtering non-missing values: suppose we want to have a new datadrame from the titanic passenger dataframe without any missing data on age column.
#The notna() conditional function returns a True for each row the values are not a Null value. 
#notna() can be combined with the selection brackets [] to filter the data table.
nonmissing_age_df = titanic_df[titanic_df["Age"].notna()]
nonmissing_age_df.shape

(714, 12)

In [297]:
#Replacing Missing Values: Often the missing values are zeros and we replace missing by zeros. Other common values to impute include the mean value or lagged values.
zero_filled_df= titanic_df.fillna(0) #this will not affect the original titanic df and only fill zeros in the new df
print('total missing values:',zero_filled_df.isnull().sum().sum())
# filling missing values in the 'Age' column of the titanic_df DataFrame with the mean of that column
mean_filled_df = titanic_df.copy()
print('total missing values in copy:',mean_filled_df.isnull().sum())
mean_filled_df['Age'].fillna(mean_filled_df['Age'].mean(), inplace=True)
print('total missing values in age:',mean_filled_df['Age'].isnull().sum())
#for imputing lag value we can use shift()
# mean_filled_df['Age'].fillna(mean_filled_df['Age'].shift(), inplace=True)

total missing values: 0
total missing values in copy: PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
total missing values in age: 0

In [298]:
#Handling Duplicate data
duplicate_values = titanic_df.duplicated() # returns True if the entire row is duplicate (False if not the enitire row is a copy)
duplicate_values.head()
# drop_duplicates drops a duplicated row (keeps only one of the duplicates rows)
#titanic_df.drop_duplicates(inplace=True)

0    False
1    False
2    False
3    False
4    False
dtype: bool

### Aggregation by groups

In [299]:
# Aggregate function: DataFrame.agg() method
# The agg function is used for aggregating data. 
#It allows you to apply one or more aggregation functions to specific columns or the entire DataFrame.
#we can specify different aggregation functions for different columns using a dictionary.

titanic_df.agg({"Age": ["min", "max", "median", "mean"],"Fare": ["min", "max", "median", "mean"]})

              Age        Fare
min      0.420000    0.000000
max     80.000000  512.329200
median  28.000000   14.454200
mean    29.699118   32.204208

In [300]:
# Grouping data: groupby method
gender= titanic_df.groupby("Sex")
print(type(gender))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [301]:
gender.size() #This is equivalent to titanic_df["Sex"].value_counts

Sex
female    314
male      577
dtype: int64

In [302]:
gender[['Survived','Fare']].sum()

        Survived        Fare
Sex
female       233  13966.6628
male         109  14727.2865

In [303]:
#the above output is same as
titanic_df.groupby("Sex")[['Survived','Fare']].sum()

        Survived        Fare
Sex
female       233  13966.6628
male         109  14727.2865

In [304]:
# calculating the average age by sex
titanic_df[["Sex", "Age"]].groupby("Sex").mean()

              Age
Sex
female  27.915709
male    30.726645

In [305]:
titanic_df.groupby("Sex")[['Survived','Fare']].agg(["min", "max", "median", "mean"])

       Survived                       Fare
            min max median      mean   min       max median       mean
Sex
female        0   1    1.0  0.742038  6.75  512.3292   23.0  44.479818
male          0   1    0.0  0.188908  0.00  512.3292   10.5  25.523893

In [306]:
#The above command is same as below:
titanic_df[['Sex', 'Survived','Fare']].groupby("Sex").agg(["min", "max", "median", "mean"])

       Survived                       Fare
            min max median      mean   min       max median       mean
Sex
female        0   1    1.0  0.742038  6.75  512.3292   23.0  44.479818
male          0   1    0.0  0.188908  0.00  512.3292   10.5  25.523893

In [307]:
#Grouping can be done by multiple columns at the same time. Provide the column names as a list to the groupby() method.
#Finding the mean, min, max ticket fare price for each of the sex and cabin class combinations:
titanic_df.groupby(["Sex", "Pclass"])["Fare"].agg(["min", "max", "median", "mean"])

                   min       max    median        mean
Sex    Pclass
female 1       25.9292  512.3292  82.66455  106.125798
       2       10.5000   65.0000  22.00000   21.970121
       3        6.7500   69.5500  12.47500   16.118810
male   1        0.0000  512.3292  41.26250   67.226127
       2        0.0000   73.5000  13.00000   19.741782
       3        0.0000   69.5500   7.92500   12.661633

### Pivot Tables

In [308]:
#The concept of pivoting data involves reshaping a dataset by converting rows into columns or vice versa. 
#Let's consider an example where we pivot the data to create a summary table 
#The summary table shows the count of passengers for each combination of Pclass (passenger class) and Survived (survival status).
#Create a pivot table to show the count of passengers for each combination of Pclass and Survived
pivot_table = pd.pivot_table(titanic_df, values='PassengerId', index='Pclass', columns='Survived', aggfunc='count', fill_value=0, margins=True)
print(pivot_table)

Survived    0    1  All
Pclass
1          80  136  216
2          97   87  184
3         372  119  491
All       549  342  891

In [309]:
#since we are simply counting, We will get the exact same output like above if we use any other non-missing column name in values argument. But not if we use a column with missing values ,e.g., age.
pivot_table_5 = pd.pivot_table(titanic_df, values='Age', index='Pclass', columns='Survived', aggfunc='count', fill_value=0, margins=True)
print(pivot_table_5)

Survived    0    1  All
Pclass
1          64  122  186
2          90   83  173
3         270   85  355
All       424  290  714

In [310]:
# Explanation of pivot_table:
# pd.pivot_table: This function is used to create a pivot table from a DataFrame.
# values='PassengerId': Specifies the values to aggregate. In this case, we are counting the number of passengers, so we use the 'PassengerId' column.
# index='Pclass': Specifies the column whose unique values will become the rows of the pivot table (in this case, 'Pclass').
# columns='Survived': Specifies the column whose unique values will become the columns of the pivot table (in this case, 'Survived').
# aggfunc='count': Specifies the aggregation function, which is 'count' in this case, indicating we want to count the number of occurrences.
# fill_value=0: Specifies the value to fill missing entries in the pivot table.
# The resulting pivot table will show the count of passengers for each combination of Pclass and Survived.
# When interested in the row/column margins (subtotals) for each variable, set the margins parameter to True

In [311]:
print(type(pivot_table))
pivot_table.reset_index()
pivot_table.head()

<class 'pandas.core.frame.DataFrame'>

Survived    0    1  All
Pclass
1          80  136  216
2          97   87  184
3         372  119  491
All       549  342  891

In [312]:
# Use groupby and count to get the same result as the pivot table
grouped_df = titanic_df.groupby(['Pclass', 'Survived'])['PassengerId'].count()
print(grouped_df)
# unstack for pivot like output
grouped_df = titanic_df.groupby(['Pclass', 'Survived'])['PassengerId'].count().unstack()
print(grouped_df)

Pclass  Survived
1       0            80
        1           136
2       0            97
        1            87
3       0           372
        1           119
Name: PassengerId, dtype: int64
Survived    0    1
Pclass
1          80  136
2          97   87
3         372  119

In [313]:
#The melt function in Pandas is used to reshape or unpivot a DataFrame. 
#It essentially converts wide-format data (where each row represents a unique combination of values) into long-format data (where each row represents a single observation).
# Use melt to reshape the pivot table
melted_df = pd.melt(pivot_table.reset_index(), id_vars=['Pclass'], value_vars=[0, 1, 'All'], var_name='Survived', value_name='PassengerCount')
print(melted_df)

   Pclass Survived  PassengerCount
0       1        0              80
1       2        0              97
2       3        0             372
3     All        0             549
4       1        1             136
5       2        1              87
6       3        1             119
7     All        1             342
8       1      All             216
9       2      All             184
10      3      All             491
11    All      All             891

In [314]:
# above melt explanation:
# pivot_table.reset_index(): Resets the index of the pivot table to turn the index columns into regular columns.
# id_vars: Specifies the columns that will be retained as identifier variables (not melted). In this case, 'Pclass'.
# value_vars: Specifies the columns that will be melted. In this case, 0, 1, and 'All'.
# var_name: Specifies the name of the new variable column. In this case, 'Survived'.
# value_name: Specifies the name of the new value column. In this case, 'PassengerCount'.

In [315]:
pivot_table_2 = pd.pivot_table(titanic_df, values='PassengerId', index='Pclass', columns='Sex', aggfunc='count', fill_value=0, margins=True)
print(pivot_table_2)

Sex     female  male  All
Pclass
1           94   122  216
2           76   108  184
3          144   347  491
All        314   577  891

In [316]:
pivot_table_3 = pd.pivot_table(titanic_df, values='Age', index=['Pclass','Sex'], aggfunc='mean', fill_value=0, margins=True)
pivot_table_3['Age'] = pivot_table_3['Age'].round(2)
#pivot_table_3= pivot_table_3.round(2)
print(pivot_table_3)

                 Age
Pclass Sex
1      female  34.61
       male    41.28
2      female  28.72
       male    30.74
3      female  21.75
       male    26.51
All            29.70

In [317]:
pivot_table_4 = pd.pivot_table(titanic_df, values='Fare', index='Pclass', columns='Sex', aggfunc='mean', fill_value=0, margins=True)
print(pivot_table_4)
pivot_table_4 = pivot_table_4.round(2)
print(pivot_table_4)

Sex         female       male        All
Pclass
1       106.125798  67.226127  84.154687
2        21.970121  19.741782  20.662183
3        16.118810  12.661633  13.675550
All      44.479818  25.523893  32.204208
Sex     female   male    All
Pclass
1       106.13  67.23  84.15
2        21.97  19.74  20.66
3        16.12  12.66  13.68
All      44.48  25.52  32.20

### Joining Tables

In [318]:
#Data Description:
#The air_quality_no2_long.csv data set provides NO2 values for the measurement stations FR04014, BETR801 and London Westminster in respectively Paris, Antwerp and London.
#The air_quality_pm25_long.csv data set provides PM25 values for the measurement stations FR04014, BETR801 and London Westminster in respectively Paris, Antwerp and London.

In [319]:
#Concatenating DataFrames in pandas is the process of combining two or more DataFrames along a particular axis, either rows or columns. 
#The concat() function performs concatenation
#Combines several dataframes to one master dataframe.

In [320]:
#Read the first data and store in a dataframe
AQI_no2_df = pd.read_csv("air_quality_no2_long.csv") #AQI_no2_df = pd.read_csv("air_quality_no2_long.csv", parse_dates=True)
AQI_no2_df.head(2)

    city country                   date.utc location parameter  value   unit
0  Paris      FR  2019-06-21 00:00:00+00:00  FR04014       no2   20.0  µg/m³
1  Paris      FR  2019-06-20 23:00:00+00:00  FR04014       no2   21.8  µg/m³

In [321]:
print("shape of first df",AQI_no2_df.shape)

shape of first df (2068, 7)

In [322]:
#Read the second data and store in a dataframe
AQI_pm25_df = pd.read_csv("air_quality_pm25_long.csv")
AQI_pm25_df.head(2)

,city,country,date.utc,location,parameter,value,unit
0,Antwerpen,BE,2019-06-18 06:00:00+00:00,BETR801,pm25,18.0,µg/m³
1,Antwerpen,BE,2019-06-17 08:00:00+00:00,BETR801,pm25,6.5,µg/m³

In [323]:
print("shape of second df",AQI_pm25_df.shape)

shape of second df (1110, 7)

In [324]:
#concatenate the above two datasets row-wise
#By default concatenation is along axis 0, so the resulting table combines the rows of the input tables.
AQI_df = pd.concat([AQI_no2_df, AQI_pm25_df], axis=0, ignore_index=True)
#This concatenation operation stacks DataFrames vertically, one below the other. 
#The resulting DataFrame will have all the rows from df1, followed by all the rows from df2
#The ignore_index=True parameter ensures that the resulting DataFrame has a continuous index.
AQI_df.head(2)

    city country                   date.utc location parameter  value   unit
0  Paris      FR  2019-06-21 00:00:00+00:00  FR04014       no2   20.0  µg/m³
1  Paris      FR  2019-06-20 23:00:00+00:00  FR04014       no2   21.8  µg/m³

In [325]:
AQI_df.shape

(3178, 7)

In [326]:
AQI_df.index

RangeIndex(start=0, stop=3178, step=1)

In [327]:
#How to concatenate multiple excel files into a single file?
#Suppose you have a lot of Excel files in a folder and you want to concatenate them one over the other 
# we need to import pandas and os library for this purpose
#use a for loop and the .concat() method in pandas as follows (the codes are commented)

# import pandas as pd
# import os

# # Specify the path to the folder containing Excel files
# folder_path = "yourpath/to/files/"

# # Get the list of Excel files in the folder: The code below uses a list comprehension to create a list of Excel files in the specified folder.
# excel_files = [f for f in os.listdir(folder_path) if f.endswith('.xlsx')]

# # Initialize an empty DataFrame to store the concatenated data
# concatenated_df = pd.DataFrame()

# # Iterate through each Excel file and concatenate the data
# for file in excel_files:
#     # Read the Excel file into a DataFrame
#     data = pd.read_excel(os.path.join(folder_path, file))
    
#     # Concatenate the current DataFrame with the overall DataFrame
#     concatenated_df = pd.concat([concatenated_df, data], ignore_index=True)

# # Display or further process the concatenated DataFrame
# print(concatenated_df.head())

# # Write the concatenated DataFrame to a new Excel file
# output_path = "yourpath/to/concatenated_output.xlsx"
# concatenated_df.to_excel(output_path, index=False)

### Joining tables using common key columns (common identifiers)

In [3]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'price': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'quantity': [4, 5, 6]})
left_merged = pd.merge(df1, df2, how='left', on='key')
print(left_merged)

  key  price  quantity
0   A      1       NaN
1   B      2       4.0
2   C      3       5.0

In [4]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'price': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'quantity': [4, 5, 6]})
right_merged = pd.merge(df1, df2, how='right', on='key')
print(right_merged)

  key  price  quantity
0   B    2.0         4
1   C    3.0         5
2   D    NaN         6

In [5]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'price': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'quantity': [4, 5, 6]})
inner_merged = pd.merge(df1, df2, how='inner', on='key')
print(inner_merged)

  key  price  quantity
0   B      2         4
1   C      3         5

In [6]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'price': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'quantity': [4, 5, 6]})
outer_merged = pd.merge(df1, df2, how='outer', on='key')
print(outer_merged)

  key  price  quantity
0   A    1.0       NaN
1   B    2.0       4.0
2   C    3.0       5.0
3   D    NaN       6.0

In [10]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'price': [1, 2, 3]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'quantity': [4, 5, 6]})
cross_merged = pd.merge(df1, df2, how='cross')
print(cross_merged)

  key_x  price key_y  quantity
0     A      1     B         4
1     A      1     C         5
2     A      1     D         6
3     B      2     B         4
4     B      2     C         5
5     B      2     D         6
6     C      3     B         4
7     C      3     C         5
8     C      3     D         6

In [328]:
#Add the station coordinates, provided by the stations metadata table, to the corresponding rows in the measurements table.

In [347]:
stations_df = pd.read_csv("air_quality_stations.csv")
print(stations_df.shape)
stations_df.head()

(65, 3)

  location  coordinates.latitude  coordinates.longitude
0  BELAL01              51.23619                4.38522
1  BELHB23              51.17030                4.34100
2  BELLD01              51.10998                5.00486
3  BELLD02              51.12038                5.02155
4  BELR833              51.32766                4.36226

In [348]:
AQI_df['location'].unique() #gets unique values of a pandas column.

array(['FR04014', 'BETR801', 'London Westminster'], dtype=object)

In [349]:
AQI_df.shape

(3178, 7)

In [350]:
#The stations used in the main airquality table are only three (FR04014, BETR801 and London Westminster). 
#We only want to add the coordinates of these three to the AQI-df table, each on the corresponding rows of the air_quality table.
#the merge() function is used to combine two or more DataFrames based on a common column
AQI_merged_df = pd.merge(AQI_df,stations_df, how="left", on="location") #you may pass a list of on=['location',etc]as well.
print(AQI_merged_df.shape)
AQI_merged_df.head()

(3178, 9)

,city,country,date.utc,location,parameter,value,unit,coordinates.latitude,coordinates.longitude
0,Paris,FR,2019-06-21 00:00:00+00:00,FR04014,no2,20.0,µg/m³,48.83722,2.3939
1,Paris,FR,2019-06-20 23:00:00+00:00,FR04014,no2,21.8,µg/m³,48.83722,2.3939
2,Paris,FR,2019-06-20 22:00:00+00:00,FR04014,no2,26.5,µg/m³,48.83722,2.3939
3,Paris,FR,2019-06-20 21:00:00+00:00,FR04014,no2,24.9,µg/m³,48.83722,2.3939
4,Paris,FR,2019-06-20 20:00:00+00:00,FR04014,no2,21.4,µg/m³,48.83722,2.3939

In [ ]:
#By choosing the left join, only the locations available in the AQI_df (left) table, i.e. FR04014, BETR801 and London Westminster, end up in the resulting table. 
#The merge function supports multiple join options similar to database-style operations: left, right, inner, outer and cross joins.
# more on merging here: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

### Manipulate Textual Data

In [95]:
titanic_df = pd.read_csv("titanic.csv")

In [96]:
titanic_df["Name"].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [102]:
#Make all name characters uppercase/lowercase
titanic_df["Upper Name"]=titanic_df["Name"].str.upper() #Note: we have to use the keyword 'str', str.lower() for lowercase, to perform string manipulation.
titanic_df["Upper Name"].head()

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                               HEIKKINEN, MISS. LAINA
3         FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                             ALLEN, MR. WILLIAM HENRY
Name: Upper Name, dtype: object

In [104]:
#Create a new column Surname that contains the surname of the passengers by extracting the part before the comma.
titanic_df["SurName"]=titanic_df["Name"].str.split(',').str.get(0) 
titanic_df["SurName"].head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: SurName, dtype: object

In [105]:
#Which passenger of the Titanic has the longest name? display all details
titanic_df["Name"].str.len().idxmax() #The idxmax() method gets the corresponding location in the table for which the name length is the largest
#The string method Series.str.contains() checks for each of the values in a string column type if the string contains the word/characters passed as an argument and returns for each of the values True or False.

307

In [108]:
titanic_df.loc[titanic_df["Name"].str.len().idxmax()]
#titanic_df.loc[titanic_df["Name"].str.len().idxmax(), 'Name'] #displays name only

PassengerId                                                  308
Survived                                                       1
Pclass                                                         1
Name           Penasco y Castellana, Mrs. Victor de Satode (M...
Sex                                                       female
Age                                                         17.0
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17758
Fare                                                       108.9
Cabin                                                        C65
Embarked                                                       C
Upper Name     PENASCO Y CASTELLANA, MRS. VICTOR DE SATODE (M...
SurName                                     Penasco y Castellana
Name: 307, dtype: object

In [112]:
#In the “Sex” column, replace values of “male” by “M” and values of “female” by “F”.
titanic_df["Gender_short"] = titanic_df["Sex"].replace({"male": "M", "female": "F"}) #Note: no str keyword  is used with replace
titanic_df["Gender_short"].head()

0    M
1    F
2    F
3    F
4    M
Name: Gender_short, dtype: object

In [118]:
#Alternatively
titanic_df["gender"] = titanic_df["Sex"].str.replace("female", "F")
titanic_df["gender"] = titanic_df["gender"].str.replace("male", "M")
titanic_df["gender"].head()

0    M
1    F
2    F
3    F
4    M
Name: gender, dtype: object